      *
      *
       01 web-cookie.
         02 web-name    pic x(80).
         02 filler      pic x value low-value.
         02 web-value   pic x(1024).
         02 filler      pic x value low-value.
         02 web-expires pic x(80).
         02 filler      pic x value low-value.
         02 web-path    pic x(80).
         02 filler      pic x value low-value.
         02 web-domain  pic x(80).
         02 filler      pic x value low-value.
         02 web-secure  pic x(6).
         02 filler      pic x value low-value.



