       01 kozukai-rec.
         02 kozukai-key.
           03 wdate-rec.
      *  pic 9(8).
             04 date-yy      pic 9(4).
             04 date-mm      pic 9(2).
             04 date-dd      pic 9(2).
           03 wdate-sec     pic 9(2).
         02 wcategory      pic 9(2).
         02 in-or-out      pic 9.
           88 in-or-out-input  value 1.
           88 in-or-out-out    value 2.
         02 money          pic 9(10).
         02 note           pic x(80).


