      *
       01 kozukai-web-if.
        02 filler pic x(80) value 'SCREENNAME'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 wscreenname pic x(80) value space.
         02 filler pic x value low-value.
        02 filler pic x(80) value 'MODE'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 wmode  pic x(10) value space.
         02 filler pic x value low-value.
        02 filler pic x(80) value 'DATE_REC'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 wdate-rec pic x(8) value space.
         02 filler pic x value low-value.
        02 filler pic x(80) value 'DATE_SEC'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 wdate-sec pic x(2) value space.
         02 filler pic x value low-value.
        02 filler pic x(80) value 'CATEGORY'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 wcategory pic xx value space.
         02 filler pic x value low-value.
        02 filler pic x(80) value 'IN_OR_OUT'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 in-or-out  pic x value space.
         02 filler pic x value low-value.
        02 filler pic x(80) value 'MONEY'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 money  pic x(10) value space.
         02 filler pic x value low-value.
        02 filler pic x(80) value 'NOTE'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 note   pic x(80) value space.
         02 filler pic x value low-value.
        02 filler pic x(80) value 'SEL_DATE_REC'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 sel-date-rec pic x(8) value space.
         02 filler pic x value low-value.
        02 filler pic x(80) value 'SEL_DATE_SEC'.
         02 filler pic x value low-value.
         02 filler pic x value space.
         02 filler pic x value low-value.
         02 sel-date-sec pic x(2) value space.
         02 filler pic x value low-value.
         
       02 DELETE-TAB-REC.
        03 filler pic x(8) value 'DELETE1'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE1   pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(8) value 'DELETE2'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE2   pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(8) value 'DELETE3'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE3   pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(8) value 'DELETE4'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE4   pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(8) value 'DELETE5'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE5   pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(8) value 'DELETE6'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE6   pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(8) value 'DELETE7'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE7   pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(8) value 'DELETE8'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE8   pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(8) value 'DELETE9'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE9   pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(8) value 'DELETE10'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 DELETE10   pic x(10) value space.
         03 filler pic x value low-value.
        02 table-items-rec.
      *---------------------1
        03 filler pic x(80) value 'DATE_REC1'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec1 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC1'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec1 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY1'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory1 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT1'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out1  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY1'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money1  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE1'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note1   pic x(80) value space.
         03 filler pic x value low-value.
      *---------------------2
        03 filler pic x(80) value 'DATE_REC2'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec2 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC2'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec2 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY2'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory2 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT2'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out2  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY2'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money2  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE2'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note2   pic x(80) value space.
         03 filler pic x value low-value.
      *---------------------3
        03 filler pic x(80) value 'DATE_REC3'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec3 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC3'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec3 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY3'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory3 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT3'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out3  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY3'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money3  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE3'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note3   pic x(80) value space.
         03 filler pic x value low-value.
      *---------------------4
        03 filler pic x(80) value 'DATE_REC4'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec4 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC4'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec4 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY4'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory4 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT4'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out4  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY4'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money4  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE4'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note4   pic x(80) value space.
         03 filler pic x value low-value.
      *---------------------5
        03 filler pic x(80) value 'DATE_REC5'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec5 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC5'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec5 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY5'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory5 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT5'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out5  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY5'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money5  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE5'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note5   pic x(80) value space.
         03 filler pic x value low-value.
      *---------------------6
        03 filler pic x(80) value 'DATE_REC6'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec6 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC6'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec6 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY6'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory6 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT6'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out6  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY6'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money6  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE6'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note6   pic x(80) value space.
         03 filler pic x value low-value.
      *---------------------7
        03 filler pic x(80) value 'DATE_REC7'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec7 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC7'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec7 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY7'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory7 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT7'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out7  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY7'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money7  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE7'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note7   pic x(80) value space.
         03 filler pic x value low-value.
      *---------------------8
        03 filler pic x(80) value 'DATE_REC8'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec8 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC8'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec8 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY8'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory8 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT8'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out8  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY8'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money8  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE8'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note8   pic x(80) value space.
         03 filler pic x value low-value.
      *---------------------9
        03 filler pic x(80) value 'DATE_REC9'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec9 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC9'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec9 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY9'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory9 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT9'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out9  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY9'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money9  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE9'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note9   pic x(80) value space.
         03 filler pic x value low-value.
      *---------------------10
        03 filler pic x(80) value 'DATE_REC10'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-rec10 pic x(8) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'DATE_SEC10'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wdate-sec10 pic x(2) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'CATEGORY10'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 wcategory10 pic xx value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'IN_OR_OUT10'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 in-or-out10  pic x value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'MONEY10'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 money10  pic x(10) value space.
         03 filler pic x value low-value.
        03 filler pic x(80) value 'NOTE10'.
         03 filler pic x value low-value.
         03 filler pic x value space.
         03 filler pic x value low-value.
         03 note10   pic x(80) value space.
         03 filler pic x value low-value.
      *
        03 filler pic x value low-value.
      *
       01 kozukai-web-in.
         02 wmode     pic x(10) value space.
         02 wdate-rec pic 9(8)  value zero.
         02 wdate-sec pic 9(2)  value zero.
         02 wcategory pic 9(2)  value zero.
         02 in-or-out pic 9     value zero.
         02 money     pic 9(10) value zero.
         02 note      pic x(80) value space.
         02 sel-date-rec pic x(8) value space.
         02 sel-date-sec pic x(2) value space.
         02 DELETE-TAB-REC.
          03 DELETE1  PIC X(10) VALUE SPACE.
          03 DELETE2  PIC X(10) VALUE SPACE.
          03 DELETE3  PIC X(10) VALUE SPACE.
          03 DELETE4  PIC X(10) VALUE SPACE.
          03 DELETE5  PIC X(10) VALUE SPACE.
          03 DELETE6  PIC X(10) VALUE SPACE.
          03 DELETE7  PIC X(10) VALUE SPACE.
          03 DELETE8  PIC X(10) VALUE SPACE.
          03 DELETE9  PIC X(10) VALUE SPACE.
          03 DELETE10 PIC X(10) VALUE SPACE.
         02 DELETE-TAB-TABLES REDEFINES DELETE-TAB-REC.
          03 delete-array pic x(10) occurs 10.
         02 table-items-rec.
      *
          03 wdate-rec1 pic 9(8)  value zero.
          03 wdate-sec1 pic 9(2)  value zero.
          03 wcategory1 pic 9(2)  value zero.
          03 in-or-out1 pic 9     value zero.
          03 money1     pic 9(10) value zero.
          03 note1      pic x(80) value space.
      *
          03 wdate-rec2 pic 9(8)  value zero.
          03 wdate-sec2 pic 9(2)  value zero.
          03 wcategory2 pic 9(2)  value zero.
          03 in-or-out2 pic 9     value zero.
          03 money2     pic 9(10) value zero.
          03 note2      pic x(80) value space.
      *
          03 wdate-rec3 pic 9(8)  value zero.
          03 wdate-sec3 pic 9(2)  value zero.
          03 wcategory3 pic 9(2)  value zero.
          03 in-or-out3 pic 9     value zero.
          03 money3     pic 9(10) value zero.
          03 note3      pic x(80) value space.
      *
          03 wdate-rec4 pic 9(8)  value zero.
          03 wdate-sec4 pic 9(2)  value zero.
          03 wcategory4 pic 9(2)  value zero.
          03 in-or-out4 pic 9     value zero.
          03 money4     pic 9(10) value zero.
          03 note4      pic x(80) value space.
      *
          03 wdate-rec5 pic 9(8)  value zero.
          03 wdate-sec5 pic 9(2)  value zero.
          03 wcategory5 pic 9(2)  value zero.
          03 in-or-out5 pic 9     value zero.
          03 money5     pic 9(10) value zero.
          03 note5      pic x(80) value space.
      *
          03 wdate-rec6 pic 9(8)  value zero.
          03 wdate-sec6 pic 9(2)  value zero.
          03 wcategory6 pic 9(2)  value zero.
          03 in-or-out6 pic 9     value zero.
          03 money6     pic 9(10) value zero.
          03 note6      pic x(80) value space.
      *
          03 wdate-rec7 pic 9(8)  value zero.
          03 wdate-sec7 pic 9(2)  value zero.
          03 wcategory7 pic 9(2)  value zero.
          03 in-or-out7 pic 9     value zero.
          03 money7     pic 9(10) value zero.
          03 note7      pic x(80) value space.
      *
          03 wdate-rec8 pic 9(8)  value zero.
          03 wdate-sec8 pic 9(2)  value zero.
          03 wcategory8 pic 9(2)  value zero.
          03 in-or-out8 pic 9     value zero.
          03 money8     pic 9(10) value zero.
          03 note8      pic x(80) value space.
      *
          03 wdate-rec9 pic 9(8)  value zero.
          03 wdate-sec9 pic 9(2)  value zero.
          03 wcategory9 pic 9(2)  value zero.
          03 in-or-out9 pic 9     value zero.
          03 money9     pic 9(10) value zero.
          03 note9      pic x(80) value space.
      *
          03 wdate-rec10 pic 9(8)  value zero.
          03 wdate-sec10 pic 9(2)  value zero.
          03 wcategory10 pic 9(2)  value zero.
          03 in-or-out10 pic 9     value zero.
          03 money10     pic 9(10) value zero.
          03 note10      pic x(80) value space.
      *
       02 table-rec redefines table-items-rec.
          03 table-array occurs 10.
            04 tbl-wdate-rec pic 9(8).
            04 tbl-wdate-sec pic 9(2).
            04 tbl-wcategory pic 9(2).
            04 tbl-in-or-out pic 9.
            04 tbl-money     pic 9(10).
            04 tbl-note      pic x(80).
            
      *
       01 kozukai-web-ot.
         02 wmode     pic x(10) value space.
         02 wdate-rec pic 9(8)  value zero.
         02 wdate-sec pic 9(2)  value zero.
         02 wcategory pic 9(2)  value zero.
         02 in-or-out pic 9     value zero.
         02 money     pic zzzzzzzzz9 value zero.
         02 note      pic x(80) value space.
         02 sel-date-rec pic 9(8) value zero.
         02 sel-date-sec pic 9(2) value zero.
         02 table-items-rec.
      *
         03 wmode1     pic x(10) value space.
         03 wdate-rec1 pic 9(8)  value zero.
         03 wdate-sec1 pic 9(2)  value zero.
         03 wcategory1 pic 9(2)  value zero.
         03 in-or-out1 pic 9     value zero.
         03 money1     pic zzzzzzzzz9 value zero.
         03 note1      pic x(80) value space.
      *
         03 wmode2     pic x(10) value space.
         03 wdate-rec2 pic 9(8)  value zero.
         03 wdate-sec2 pic 9(2)  value zero.
         03 wcategory2 pic 9(2)  value zero.
         03 in-or-out2 pic 9     value zero.
         03 money2     pic zzzzzzzzz9 value zero.
         03 note2      pic x(80) value space.
      *
         03 wmode3     pic x(10) value space.
         03 wdate-rec3 pic 9(8)  value zero.
         03 wdate-sec3 pic 9(2)  value zero.
         03 wcategory3 pic 9(2)  value zero.
         03 in-or-out3 pic 9     value zero.
         03 money3     pic zzzzzzzzz9 value zero.
         03 note3      pic x(80) value space.
      *
         03 wmode4     pic x(10) value space.
         03 wdate-rec4 pic 9(8)  value zero.
         03 wdate-sec4 pic 9(2)  value zero.
         03 wcategory4 pic 9(2)  value zero.
         03 in-or-out4 pic 9     value zero.
         03 money4     pic zzzzzzzzz9 value zero.
         03 note4      pic x(80) value space.
      *
         03 wmode5     pic x(10) value space.
         03 wdate-rec5 pic 9(8)  value zero.
         03 wdate-sec5 pic 9(2)  value zero.
         03 wcategory5 pic 9(2)  value zero.
         03 in-or-out5 pic 9     value zero.
         03 money5     pic zzzzzzzzz9 value zero.
         03 note5      pic x(80) value space.
      *
         03 wmode6     pic x(10) value space.
         03 wdate-rec6 pic 9(8)  value zero.
         03 wdate-sec6 pic 9(2)  value zero.
         03 wcategory6 pic 9(2)  value zero.
         03 in-or-out6 pic 9     value zero.
         03 money6     pic zzzzzzzzz9 value zero.
         03 note6      pic x(80) value space.
      *
         03 wmode7     pic x(10) value space.
         03 wdate-rec7 pic 9(8)  value zero.
         03 wdate-sec7 pic 9(2)  value zero.
         03 wcategory7 pic 9(2)  value zero.
         03 in-or-out7 pic 9     value zero.
         03 money7     pic zzzzzzzzz9 value zero.
         03 note7      pic x(80) value space.
      *
         03 wmode8     pic x(10) value space.
         03 wdate-rec8 pic 9(8)  value zero.
         03 wdate-sec8 pic 9(2)  value zero.
         03 wcategory8 pic 9(2)  value zero.
         03 in-or-out8 pic 9     value zero.
         03 money8     pic zzzzzzzzz9 value zero.
         03 note8      pic x(80) value space.
      *
         03 wmode9     pic x(10) value space.
         03 wdate-rec9 pic 9(8)  value zero.
         03 wdate-sec9 pic 9(2)  value zero.
         03 wcategory9 pic 9(2)  value zero.
         03 in-or-out9 pic 9     value zero.
         03 money9     pic zzzzzzzzz9 value zero.
         03 note9      pic x(80) value space.
      *
         03 wmode10     pic x(10) value space.
         03 wdate-rec10 pic 9(8)  value zero.
         03 wdate-sec10 pic 9(2)  value zero.
         03 wcategory10 pic 9(2)  value zero.
         03 in-or-out10 pic 9     value zero.
         03 money10     pic zzzzzzzzz9 value zero.
         03 note10      pic x(80) value space.
